<a href="https://colab.research.google.com/github/Janestreett/basis-data-bab-4/blob/main/bab5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

ğŸ“ Praktikum Basis Data - BAB 5: Data Manipulation Language (DML)

ğŸ¯ Kompetensi

1. Praktikan dapat mengoperasikan perintah DML
2. Praktikan dapat memilih perintah DML yang tepat untuk memanipulasi table

ğŸ“– Topik Pembahasan

Â· Insert Table - Memasukkan data
Â· Query Sederhana - Menampilkan data
Â· Update Table - Mengubah data
Â· Delete Data - Menghapus data
Â· Query dengan Kondisi - Filter data

---

ğŸ§ª TEST AWAL

1. Bagaimana cara memasukkan data ke table?
      Contoh: INSERT INTO table_name VALUES (value1, value2, ...);
2. Bagaimana cara menghapus data dari table?
      Contoh: DELETE FROM table_name WHERE condition;

---

ğŸ“¥ 5.3 INSERT TABLE

Sintaks Dasar:

```sql
-- Metode 1: Insert semua kolom
INSERT INTO nama_table VALUES (value1, value2, ..., valueN);

-- Metode 2: Insert kolom tertentu
INSERT INTO nama_table (kolom1, kolom2, ..., kolomN)
VALUES (value1, value2, ..., valueN);
```

Contoh Implementasi:

```sql
-- Contoh 1: Insert semua kolom
INSERT INTO mahasiswa VALUES ('00002682', 'Paijo', 'Jalan Merdeka No 11');

-- Contoh 2: Insert kolom tertentu
INSERT INTO mahasiswa(NIM, Nama_Mhs, Alamat)
VALUES ('07080905040', 'Paijo', 'Jl Jembatan Merah no 23');
```

---

ğŸ” 5.4 QUERY SEDERHANA

5.4.1 Menampilkan Semua Data

```sql
SELECT * FROM nama_table;
```

Contoh:

```sql
SELECT * FROM mahasiswa;
```

Hasil:

```
| NIM         | Nama_Mhs | Alamat               |
|-------------|----------|----------------------|
| 00002682    | Paijo    | Jalan Merdeka No 11  |
| 07080905040 | Paijo    | Jl Jembatan Merah no 23 |
```

5.4.2 Menampilkan Kolom Tertentu

```sql
SELECT kolom1, kolom2 FROM nama_table;
```

Contoh:

```sql
SELECT NIM, Nama_Mhs FROM mahasiswa;
```

5.4.3 Menampilkan Baris Tertentu dengan WHERE

```sql
SELECT * FROM nama_table WHERE kondisi;
```

Contoh:

```sql
SELECT * FROM mahasiswa WHERE NIM = '00002682';
```

---

âœï¸ 5.5 UPDATE TABLE

Sintaks:

```sql
UPDATE nama_table
SET kolom1 = 'value_baru', kolom2 = 'value_baru'
WHERE kondisi;
```

Contoh:

```sql
UPDATE customers
SET cust_address = 'Sleman Yogyakarta', cust_country = 'IND'
WHERE cust_id = '10002';
```

---

ğŸ—‘ï¸ 5.6 DELETE DATA

Sintaks:

```sql
DELETE FROM nama_table WHERE kondisi;
```

Contoh:

```sql
DELETE FROM mahasiswa WHERE NIM = '00002682';
```

---

ğŸ” 5.7 QUERY DENGAN KONDISI

Operator Relasional:

Operator Keterangan
= Sama dengan
> Lebih besar dari
< Lebih kecil dari
>= Lebih besar sama dengan
<= Lebih kecil sama dengan
<> atau != Tidak sama dengan

Contoh Query dengan Kondisi:

Menggunakan OR:

```sql
SELECT * FROM customers
WHERE cust_id = '10001' OR cust_name = 'Wascals';
```

Menggunakan Perbandingan Harga:

```sql
SELECT prod_name FROM products
WHERE prod_price > 20;
```

Hasil:

```
| prod_name    |
|--------------|
| JetPack 1000 |
| JetPack 2000 |
| Safe         |
```

---

ğŸ“Š 5.8 TEST AKHIR

1. Isi Data untuk Skema Order Entry

a. Tabel Customers

```sql
SELECT * FROM customers;
```

Data yang diharapkan:

Â· 10000 - Coyote Inc.
Â· 10001 - Wascals
Â· 10002 - Yosemite Place
Â· 10003 - E Fudd

b. Tabel Products

```sql
SELECT * FROM products;
```

Produk contoh:

Â· ANV01, ANV02, ANV03 (Anvils)
Â· DTNTR (Detonator)
Â· FB, FC (Bird seed)
Â· JP1000, JP2000 (JetPacks)
Â· SAFE (Safe)
Â· SLING (Sling)
Â· TNT1, TNT2 (TNT)

c. Tabel Vendors

```sql
SELECT * FROM vendors;
```

Vendor contoh:

Â· 1001 - Anvils R Us
Â· 1002 - LT Supplies
Â· 1003 - ACME
Â· 1004 - Furball Inc.
Â· 1005 - Jet Set
Â· 1006 - Jouets Et Ours

d. Tabel OrderItems

```sql
SELECT * FROM orderitems;
```

Contoh order items dengan quantity yang berbeda.

2. Query yang Harus Dilakukan

Buat dan eksekusi berbagai query SELECT dengan kondisi yang berbeda untuk melatih pemahaman DML.


3. Buatlah laporan praktikum dengan ketentuan sebagai berikut :
a. Nama file laporan : PrakDB_Bab5-NIM.odt
b. Isi file laporan :
i. Source SQL
ii. Screenshot CMD
c. Simpan di directory â€œPrakDB-NIMâ€ .